{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": 3
  },
  "orig_nbformat": 2,
  "kernelspec": {
   "name": "python395jvsc74a57bd04cd7ab41f5fca4b9b44701077e38c5ffd31fe66a6cab21e0214b68d958d0e462",
   "display_name": "SPARQL",
   "language": "sparql"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "output_type": "display_data",
     "data": {
      "text/html": "<div class=\"krn-spql\"><div class=\"magic\">Endpoint set to: https://staging.gss-data.org.uk/sparql</div><div class=\"magic\">Request format: ANY</div><div class=\"magic\">Display: table</div></div>",
      "text/plain": "Endpoint set to: https://staging.gss-data.org.uk/sparql\nRequest format: ANY\nDisplay: table\n"
     },
     "metadata": {}
    }
   ],
   "source": [
    "%endpoint https://staging.gss-data.org.uk/sparql\n",
    "%format any\n",
    "%display table"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "output_type": "display_data",
     "data": {
      "text/html": "<div class=\"krn-spql\"><table><tr class=hdr><th>dataset</th>\n<th>cntObs</th>\n<th>cntDim</th></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset</a></td>\n<td class=val>3</td>\n<td class=val>4</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/sdg/indicators/proportion-of-children-under-5-years-of-age-whose-births-have-been-registered-with-a-civil-authority-by-age#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/sdg/indicators/proportion-of-children-under-5-years-of-age-whose-births-have-been-registered-with-a-civil-authority-by-age#dataset</a></td>\n<td class=val>3</td>\n<td class=val>3</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/sdg/indicators/publicly-accessible-green-space-as-a-proportion-of-urban-area#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/sdg/indicators/publicly-accessible-green-space-as-a-proportion-of-urban-area#dataset</a></td>\n<td class=val>4</td>\n<td class=val>3</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-fuelcosts#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-fuelcosts#dataset</a></td>\n<td class=val>9</td>\n<td class=val>4</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-paymentagg#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-paymentagg#dataset</a></td>\n<td class=val>9</td>\n<td class=val>4</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-paymentavg#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-paymentavg#dataset</a></td>\n<td class=val>9</td>\n<td class=val>4</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-fpeer#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-fpeer#dataset</a></td>\n<td class=val>9</td>\n<td class=val>4</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-floorarea#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-floorarea#dataset</a></td>\n<td class=val>9</td>\n<td class=val>4</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-housingcosts#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/fupt-housingcosts#dataset</a></td>\n<td class=val>9</td>\n<td class=val>4</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-eligibilityagg#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-eligibilityagg#dataset</a></td>\n<td class=val>12</td>\n<td class=val>4</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-housingcosts#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-housingcosts#dataset</a></td>\n<td class=val>12</td>\n<td class=val>4</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-eligibilityavg#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-eligibilityavg#dataset</a></td>\n<td class=val>12</td>\n<td class=val>4</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-fpeer#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-fpeer#dataset</a></td>\n<td class=val>12</td>\n<td class=val>4</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-fuelcosts#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-fuelcosts#dataset</a></td>\n<td class=val>12</td>\n<td class=val>4</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-floorarea#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoin-floorarea#dataset</a></td>\n<td class=val>12</td>\n<td class=val>4</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-incomeavg#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-incomeavg#dataset</a></td>\n<td class=val>22</td>\n<td class=val>5</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoch-fpeer#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoch-fpeer#dataset</a></td>\n<td class=val>22</td>\n<td class=val>7</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-incomeagg#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-detailed-tables-2020/edc-fuelcosts-incomeagg#dataset</a></td>\n<td class=val>24</td>\n<td class=val>5</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoch-housingcosts#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoch-housingcosts#dataset</a></td>\n<td class=val>30</td>\n<td class=val>7</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoch-fuelcosts#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/beis-fuel-poverty-supplementary-tables-2020/hoch-fuelcosts#dataset</a></td>\n<td class=val>30</td>\n<td class=val>7</td></tr></table><div class=\"tinfo\">Total: 100, Shown: 20</div></div>"
     },
     "metadata": {}
    }
   ],
   "source": [
    "PREFIX dcat: <http://www.w3.org/ns/dcat#>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX void: <http://rdfs.org/ns/void#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?dataset ?cntObs (COUNT(?dimension) as ?cntDim)\n",
    "WHERE {\n",
    "\t{\n",
    "      SELECT ?dataset (COUNT(?observation) as ?cntObs) \n",
    "      WHERE { \n",
    "\n",
    "      ?dataset a qb:DataSet.\n",
    "      ?observation qb:dataSet ?dataset.\n",
    "\n",
    "      }\n",
    "      GROUP BY ?dataset\n",
    "      ORDER BY ASC(?cntObs)\n",
    "      LIMIT 100\n",
    "\t}\n",
    "\n",
    " ?dataset qb:structure/qb:component/qb:dimension ?dimension\n",
    "} \n",
    "GROUP BY ?dataset ?cntObs \n",
    "ORDER BY ASC(?cntObs) ASC(?cndDim)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "output_type": "display_data",
     "data": {
      "text/html": "<div class=\"krn-spql\"><table><tr class=hdr><th>gr1</th>\n<th>s</th>\n<th>p</th>\n<th>o</th></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://www.w3.org/ns/prov#wasGeneratedBy\" target=\"_other\">http://www.w3.org/ns/prov#wasGeneratedBy</a></td>\n<td class=val><a href=\"https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/42/\" target=\"_other\">https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/42/</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#measureType\" target=\"_other\">http://purl.org/linked-data/cube#measureType</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DimensionProperty\" target=\"_other\">http://purl.org/linked-data/cube#DimensionProperty</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/sdmx/2009/attribute#unitMeasure\" target=\"_other\">http://purl.org/linked-data/sdmx/2009/attribute#unitMeasure</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#AttributeProperty\" target=\"_other\">http://purl.org/linked-data/cube#AttributeProperty</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/\" target=\"_other\">https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://www.w3.org/ns/prov#Agent\" target=\"_other\">http://www.w3.org/ns/prov#Agent</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://www.w3.org/ns/dcat#Dataset\" target=\"_other\">http://www.w3.org/ns/dcat#Dataset</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DataSet\" target=\"_other\">http://purl.org/linked-data/cube#DataSet</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DataStructureDefinition\" target=\"_other\">http://purl.org/linked-data/cube#DataStructureDefinition</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#ComponentSpecification\" target=\"_other\">http://purl.org/linked-data/cube#ComponentSpecification</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/nation\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/nation</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#ComponentSpecification\" target=\"_other\">http://purl.org/linked-data/cube#ComponentSpecification</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/period\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/period</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#ComponentSpecification\" target=\"_other\">http://purl.org/linked-data/cube#ComponentSpecification</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/scheme-year\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/scheme-year</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#ComponentSpecification\" target=\"_other\">http://purl.org/linked-data/cube#ComponentSpecification</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/unit\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/unit</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#ComponentSpecification\" target=\"_other\">http://purl.org/linked-data/cube#ComponentSpecification</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/value\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/value</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#ComponentSpecification\" target=\"_other\">http://purl.org/linked-data/cube#ComponentSpecification</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dimension/period\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dimension/period</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DimensionProperty\" target=\"_other\">http://purl.org/linked-data/cube#DimensionProperty</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dimension/scheme-year\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dimension/scheme-year</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DimensionProperty\" target=\"_other\">http://purl.org/linked-data/cube#DimensionProperty</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dimension/nation\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dimension/nation</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DimensionProperty\" target=\"_other\">http://purl.org/linked-data/cube#DimensionProperty</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/def/measure/expenditure\" target=\"_other\">http://gss-data.org.uk/def/measure/expenditure</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#MeasureProperty\" target=\"_other\">http://purl.org/linked-data/cube#MeasureProperty</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure/gregorian-interval/2018-08-15T00:00:00/P228D/year-8/E92000001\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure/gregorian-interval/2018-08-15T00:00:00/P228D/year-8/E92000001</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#Observation\" target=\"_other\">http://purl.org/linked-data/cube#Observation</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure/gregorian-interval/2018-08-15T00:00:00/P228D/year-8/S92000003\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure/gregorian-interval/2018-08-15T00:00:00/P228D/year-8/S92000003</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#Observation\" target=\"_other\">http://purl.org/linked-data/cube#Observation</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure/gregorian-interval/2018-08-15T00:00:00/P228D/year-8/W92000004\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure/gregorian-interval/2018-08-15T00:00:00/P228D/year-8/W92000004</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#Observation\" target=\"_other\">http://purl.org/linked-data/cube#Observation</a></td></tr></table><div class=\"tinfo\">Total: 78, Shown: 20</div></div>"
     },
     "metadata": {}
    }
   ],
   "source": [
    "PREFIX dcat: <http://www.w3.org/ns/dcat#>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX void: <http://rdfs.org/ns/void#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT *\n",
    "WHERE {\n",
    "    BIND(<http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure> as ?gr1).\n",
    "    GRAPH ?gr1 {\n",
    "        ?s ?p ?o.\n",
    "    }\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "output_type": "display_data",
     "data": {
      "text/html": "<div class=\"krn-spql\"><table><tr class=hdr><th>gr1</th>\n<th>s</th>\n<th>p</th>\n<th>o</th></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#measureType\" target=\"_other\">http://purl.org/linked-data/cube#measureType</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DimensionProperty\" target=\"_other\">http://purl.org/linked-data/cube#DimensionProperty</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#measureType\" target=\"_other\">http://purl.org/linked-data/cube#measureType</a></td>\n<td class=val><a href=\"http://www.w3.org/2000/01/rdf-schema#range\" target=\"_other\">http://www.w3.org/2000/01/rdf-schema#range</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#MeasureProperty\" target=\"_other\">http://purl.org/linked-data/cube#MeasureProperty</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/sdmx/2009/attribute#unitMeasure\" target=\"_other\">http://purl.org/linked-data/sdmx/2009/attribute#unitMeasure</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#AttributeProperty\" target=\"_other\">http://purl.org/linked-data/cube#AttributeProperty</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/\" target=\"_other\">https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://www.w3.org/ns/prov#Agent\" target=\"_other\">http://www.w3.org/ns/prov#Agent</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/\" target=\"_other\">https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/</a></td>\n<td class=val><a href=\"http://www.w3.org/2000/01/rdf-schema#label\" target=\"_other\">http://www.w3.org/2000/01/rdf-schema#label</a></td>\n<td class=val>GSS_data » Energy Data Visibility » Ofgem-Warm-Home-Discount-scheme</td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/\" target=\"_other\">https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/def/gdp#uniqueID\" target=\"_other\">http://gss-data.org.uk/def/gdp#uniqueID</a></td>\n<td class=val>NDY2MWI5ODgtOGY1Ny00MTVkLTk1Nj</td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://www.w3.org/ns/prov#wasGeneratedBy\" target=\"_other\">http://www.w3.org/ns/prov#wasGeneratedBy</a></td>\n<td class=val><a href=\"https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/42/\" target=\"_other\">https://ci.floop.org.uk/job/GSS_data/job/EDVP/job/Ofgem-Warm-Home-Discount-scheme/42/</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#tables\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#tables</a></td>\n<td class=val><a href=\"http://www.w3.org/ns/prov#hadDerivation\" target=\"_other\">http://www.w3.org/ns/prov#hadDerivation</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://www.w3.org/ns/dcat#Dataset\" target=\"_other\">http://www.w3.org/ns/dcat#Dataset</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DataSet\" target=\"_other\">http://purl.org/linked-data/cube#DataSet</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#dataset</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#structure\" target=\"_other\">http://purl.org/linked-data/cube#structure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#DataStructureDefinition\" target=\"_other\">http://purl.org/linked-data/cube#DataStructureDefinition</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#component\" target=\"_other\">http://purl.org/linked-data/cube#component</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#component\" target=\"_other\">http://purl.org/linked-data/cube#component</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/nation\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/nation</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#component\" target=\"_other\">http://purl.org/linked-data/cube#component</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/period\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/period</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#component\" target=\"_other\">http://purl.org/linked-data/cube#component</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/scheme-year\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/scheme-year</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#component\" target=\"_other\">http://purl.org/linked-data/cube#component</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/unit\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/unit</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#structure</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#component\" target=\"_other\">http://purl.org/linked-data/cube#component</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/value\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/value</a></td></tr><tr class=odd><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type</a></td>\n<td class=val><a href=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#type\" target=\"_other\">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#ComponentSpecification\" target=\"_other\">http://purl.org/linked-data/cube#ComponentSpecification</a></td></tr><tr class=even><td class=val><a href=\"http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure\" target=\"_other\">http://gss-data.org.uk/graph/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure</a></td>\n<td class=val><a href=\"http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type\" target=\"_other\">http://gss-data.org.uk/data/gss_data/edvp/ofgem-warm-home-discount-scheme/nationexpenditure#component/measure_type</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#componentProperty\" target=\"_other\">http://purl.org/linked-data/cube#componentProperty</a></td>\n<td class=val><a href=\"http://purl.org/linked-data/cube#measureType\" target=\"_other\">http://purl.org/linked-data/cube#measureType</a></td></tr></table><div class=\"tinfo\">Total: 78, Shown: 20</div></div>"
     },
     "metadata": {}
    }
   ],
   "source": [
    "PREFIX dcat: <http://www.w3.org/ns/dcat#>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX void: <http://rdfs.org/ns/void#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX pmdcat: <http://publishmydata.com/pmdcat#>\n",
    "\n",
    "SELECT *\n",
    "WHERE {\n",
    "    GRAPH ?gr1 {\n",
    "        ?s ?p ?o\n",
    "    }\n",
    "    {\n",
    "        SELECT ?gr1\n",
    "        WHERE {\n",
    "            ?cat rdfs:label \"Warm Home Discount Scheme: Percentage spend by nation\"@en .\n",
    "            ?cat pmdcat:graph ?gr1\n",
    "        }\n",
    "    }\n",
    "}\n",
    " \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ]
}